# Задание task_04_02_01.
#
# Выполнил: Глушков Богдан
# Группа: АДЭУ-201
x = float(input())
if x >= 0:
    f = (x ** (1 / 2) + (x ** 2))
else:
    f = 1 / x

print(round(f, 2))


# --------------
# Пример вывода:
#
# Введите число x: -10
# f = -0.10

# Введите число x: 0
# f = 0.00

# Введите число x: 10
# f = 103.16

