# Задание task_04_02_10.
#
# Выполнил: Глушков Богдан
# Группа: АДЭУ-201



n = int(input("n="))

n_sum = 0
n_count = 0
q = 0
while n > 0:
    q = (n % 10)
    n_sum += q
    n_count += 1
    n = n // 10
else:
    print("СУММА=" + str(n_sum))
    print("КОЛИЧЕСТВО=" + str(n_count))

# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# n = 12345
# Сумма = 15
# Количество = 5
