# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_09.
#
# Выполнил:Glushkov
# Группа: АДЭУ-201


word = "объектно-ориентированный"

w1 = word[:6]  # (слово объект)
w2 = word[9:17]
w3 = word[14:17]
w4 = word[4] + word[7] + word[5]
w5 = word[10] + word[12:15] + word[19]

print(w1, w2, w3, w4, w5, sep="\n")


# --------------
# Пример вывода:
#
# объект
# ориентир
# тир
# кот
# рента
