# Задание task_04_02_18.
#
# Выполнил: Глушков Богдан
# Группа: АДЭУ-201

count_gl = 0  # Кол-во гласных
count_sogl = 0  # Кол-во согласных

sentence = input("Введите предложение:").lower()
glasn = ['а', 'е', 'ё', 'и', 'о', 'у', 'ы', 'э', 'ю', 'я']
soglasn = ['б', 'в', 'г', 'д', 'ж', 'з', 'й', 'к', 'л', 'м', 'н', 'п', 'р', 'с', 'т', 'ф', 'х', 'ц', 'ч', 'ш', 'щ']
for i in sentence:
    if i == ' ':
        continue
    for g in glasn:
        if i == g:
            count_gl += 1
    for s in soglasn:
        if i == s:
            count_sogl += 1
print("Кол-во букв в предложении: гласных - {gs}, согласных - {sg}".format(gs = count_gl, sg = count_sogl))




# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# Введите предложение: Программирование
# Кол-во букв в предложении: гласных - 7, согласных - 9
