# Задание task_04_02_19.
#
# Выполнил: Глушков Богдан
# Группа: АДЭУ-201



a = int(input("a="))
b = int(input("b="))
c = int(input("c="))
for i in range(a, b + 1):
    if (i % c) == 0:
        print(i,end=' ')

# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# a = 1
# b = 10
# c = 2
# 2 4 6 8 10
