# Программирование на языке высокого уровня (Python).
# Задание task_03_02_02.
#
# Выполнил: Glushkov
# Группа: АДЭУ-201



x = int(input("x="))
y = int(input("y="))
z = int(input("z="))

res = (((x**5+7)/(abs(-6)*y))**(1/3))/(7-z%y)
print(round(res, 2))

# Удалите комментарий и допишите код


# --------------
# Пример вывода:
#
# x=0
# y=1
# z=2
# 0.15
