# Задание task_04_02_20.
#
# Выполнил: Глушков Богдан
# Группа: АДЭУ-201

n = int(input("n = "))
numb = 0
for i in range(100, 1000):
    kusok = i % 10 + (i//10)%10 + i//100
    if kusok == n:
        print(i, end = ' ')




# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# n = 3
# 102 111 120 201 210 300
