
# Задание task_04_02_06.
#
# Выполнил: Глушков Богдан
# Группа: АДЭУ-201


a = float(input("a ="))
b = float(input("b ="))
c = float(input("c ="))

# Расчет дискриминанта
if (a != 0):
    d = (b ** 2) - (4 * a * c)
    if (d > 0):
        x1 = (-b + d ** 0.5) / (2 * a)
        x2 = (-b - d ** 0.5) / (2 * a)
        print("x1= " + str(round(x1, 1)))
        print("x2= " + str(round(x2, 1)))
    elif (d == 0):
        x = ((0 - b) + d ** 0.5)/(2 * a)
        print("x= " + str(round(x, 1)))
    else:
        print("РЕШЕНИЙ НЕТ!!!!")

# Вывод решения в зависимости от значения дискриминанта
# При выводе значений оставьте 1 знак после запятой
# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# a = 1
# b = 2
# c = 3
# Решений нет
#
# a = 1
# b = 2
# c = 1
# x = -1.0
#
# a = 1
# b = 3
# c = -4
# x1 = -4.0, x2 = 1.0