# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_03.
#
# Выполнил: Glushkov
# Группа: АДЭУ-201



# Сопротивление первого проводника
r1 = float(input("r1="))
# Сопротивление второго проводника
r2 = float(input("r2="))

# Общее сопротивление
r = r1 + r2
r = float(r)
print(r)

# Удалите комментарий и допишите код


# --------------
# Пример вывода:
#
# r1=12.2
# r2=16.1
# 28.3
