
# Задание task_05_02_08.
#
# Выполнил: Глушков Богдан
# Группа: АДЭУ-201


def print_with_border(s, k):
    n = len(s)
    c = (k * (n + 2))
    t = (f'{k}{s}{k}')
    p = (k * (n + 2))
    return c, t, p


s = input('Введите строку:')
k = input('Введите символ:')

list = print_with_border(s,k)

print(list[0])
print(list[1])
print(list[2])
# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# Введите строку: Просто текст
# Введите символ: +
# ++++++++++++++
# +Просто текст+
# ++++++++++++++