
# Задание task_04_02_08.
#
# Выполнил: Глушков Богдан
# Группа: АДЭУ-201



n = int(input("n="))
listik = [0,5,10,15,20,25]
i = 0
while listik[i] < n and i < 5:
    print(listik[i])
    i+=1


# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# n = 0
# 0
#
# n = 10
# 0
# 5
# 10
#
# n = 12
# 0
# 5
# 10